# Hands on: Summarization

### Overview

- [1.1. Import the file titanicData.csv to a dataframe](#ch1_1)</a>

- [1.2.	Obtain information and a summary of the data. Comment on that.](#ch1_2)</a>

- [1.3. Do you notice any redundant or irrelevant attributes that you can remove? Why? ](#ch1_3)</a>

- [1.4.	Find out how many missing values are represented.](#ch1_4)</a>

- [1.5. Identify...](#ch1_5)</a>

- [1.6. Identify the total number of passengers who survive.](#ch1_6)</a>

- [1.7. Show information about females.](#ch1_7)</a>

- [1.8. Get the percentage of females and males.](#ch1_8)</a>

- [1.9. Get the total of females and males who survive.](#ch1_9)</a>

- [1.10. Find the number of passengers per class. ](#ch1_10)</a>

- [1.11. For each combination of Gender and Pass_class obtain the number of survivals.](#ch1_11)</a>

- [1.12. What is the average age per gender? ](#ch1_12)</a>

- [1.13. For each combination of Gender and Pass_class obtain the maximum and minimum age.](#ch1_13)</a>

- [1.14. Get the percentage of minors.](#ch1_14)</a>

- [1.15. What is the total of minors who survive?](#ch1_15)</a>

- [1.16. What is the average age of the minors? What is the average age of the minors which survive?](#ch1_16)</a>

- [1.17. According to the survival status obtain the median, average, and skew age of minors. Compare with the average age of minors.](#ch1_17)</a>

- [1.18. Get the covariance matrix for all the numerical attributes.](#ch1_18)</a> 

- [1.19. Find the most correlated pair of attributes. Comment on the results.](#ch1_19)</a>

In [1]:
# to execute and return the results of executions
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## 1.1.	Import the file titanicData.csv to a dataframe (csv file is available in eLearning). <a name="ch1_1"></a>

In [2]:
import pandas as pd
df = pd.read_csv("titanicData.csv", sep=';')
df

,Pass_class,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

## 1.2.	Obtain information and a summary of the data. Comment on that. <a name="ch1_2"></a>

In [3]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pass_class  1309 non-null   int64
 1   name        1309 non-null   object
 2   sex         1309 non-null   object
 3   age         1046 non-null   float64
 4   sibsp       1309 non-null   int64
 5   parch       1309 non-null   int64
 6   ticket      1309 non-null   object
 7   fare        1308 non-null   float64
 8   cabin       295 non-null    object
 9   embarked    1307 non-null   object
 10  survived    1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

,Pass_class,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
count,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308.000000,295,1307,1309.000000
unique,NaN,1307,2,NaN,NaN,NaN,929,NaN,186,3,NaN
top,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S,NaN
freq,NaN,2,843,NaN,NaN,NaN,11,NaN,6,914,NaN
mean,2.294882,NaN,NaN,29.881135,0.498854,0.385027,NaN,33.295479,NaN,NaN,0.381971
std,0.837836,NaN,NaN,14.413500,1.041658,0.865560,NaN,51.758668,NaN,NaN,0.486055
min,1.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,0.000000,NaN,NaN,0.000000
25%,2.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,7.895800,NaN,NaN,0.000000
50%,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN,0.000000
75%,3.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,31.275000,NaN,NaN,1.000000
max,3.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,512.329200,NaN,NaN,1.000000

### Comments? Insights?

## 1.3.	Do you notice any redundant or irrelevant attributes that you can remove? Why? <a name="ch1_3"></a>

## 1.4.	Find out how many missing values are represented. <a name="ch1_4"></a>

**Q: Considering the number of missing values and the size of the dataset, which do you consider as the most appropriate procedure for attributes:**
- `embarked`?
- `cabin`?         
- `age`?

## 1.5.	Identify the: <a name="ch1_5"></a>
### 1.5.1.	dimensionality and size of the dataframe.
### 1.5.2.	features’ names.
### 1.5.3.	type and scale of the attributes.
### 1.5.4.	number of distinct values (except for attributes 'name' and ‘age’).
### 1.5.5.	number of classes.

In [4]:
# dimensionality

# size

In [5]:
#features’ names

In [6]:
#number of distinct values
# see pandas.DataFrame.nunique
help(pd.DataFrame.nunique)

Help on function nunique in module pandas.core.frame:

nunique(self, axis: 'Axis' = 0, dropna: 'bool' = True) -> 'Series'
    Count number of distinct elements in specified axis.

    Return Series with number of distinct elements. Can ignore NaN
    values.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        The axis to use. 0 or 'index' for row-wise, 1 or 'columns' for
        column-wise.
    dropna : bool, default True
        Don't include NaN in the counts.

    Returns
    -------
    Series

    See Also
    --------
    Series.nunique: Method nunique for Series.
    DataFrame.count: Count non-NA cells for each column or row.

    Examples
    --------
    >>> df = pd.DataFrame({'A': [4, 5, 6], 'B': [4, 1, 1]})
    >>> df.nunique()
    A    3
    B    2
    dtype: int64

    >>> df.nunique(axis=1)
    0    1
    1    2
    2    2
    dtype: int64

In [7]:
#number of distinct classes

## 1.6.	Identify the total number of passengers who survive. <a name="ch1_6"></a>

In [8]:
# Number of passengers who survived
NumbSurvived = (df.survived == 1).sum()
NumbSurvived

500

## 1.7.	Show information about females. <a name="ch1_7"></a>

In [9]:
df_females = df[df["sex"]=='female']
#  which methodos should you use ?

## 1.8.	Get the percentage of females and males. <a name="ch1_8"></a>

In [10]:
# Number of total passengers
total_pass = ???

Numb_females = (df.sex=='female').sum()

Numb_males = ???

Perc_females = Numb_females/total_pass
Perc_males = Numb_males/total_pass

print('Precentage of females = ', Perc_females)
print('Precentage of males = ', Perc_males)

SyntaxError: invalid syntax (2566372476.py, line 2)

## 1.9.	Get the total of females and males who survive. <a name="ch1_9"></a>

In [11]:
help(pd.crosstab)

Help on function crosstab in module pandas.core.reshape.pivot:

crosstab(index, columns, values=None, rownames=None, colnames=None, aggfunc=None, margins: 'bool' = False, margins_name: 'str' = 'All', dropna: 'bool' = True, normalize=False) -> 'DataFrame'
    Compute a simple cross tabulation of two (or more) factors. By default
    computes a frequency table of the factors unless an array of values and an
    aggregation function are passed.

    Parameters
    ----------
    index : array-like, Series, or list of arrays/Series
        Values to group by in the rows.
    columns : array-like, Series, or list of arrays/Series
        Values to group by in the columns.
    values : array-like, optional
        Array of values to aggregate according to the factors.
        Requires `aggfunc` be specified.
    rownames : sequence, default None
        If passed, must match number of row arrays passed.
    colnames : sequence, default None
        If passed, must match number of column arrays passed.
    aggfunc : function, optional
        If specified, requires `values` be specified as well.
    margins : bool, default False
        Add row/column margins (subtotals).
    margins_name : str, default 'All'
        Name of the row/column that will contain the totals
        when margins is True.
    dropna : bool, default True
        Do not include columns whose entries are all NaN.
    normalize : bool, {'all', 'index', 'columns'}, or {0,1}, default False
        Normalize by dividing all values by the sum of values.

        - If passed 'all' or `True`, will normalize over all values.
        - If passed 'index' will normalize over each row.
        - If passed 'columns' will normalize over each column.
        - If margins is `True`, will also normalize margin values.

    Returns
    -------
    DataFrame
        Cross tabulation of the data.

    See Also
    --------
    DataFrame.pivot : Reshape data based on column values.
    pivot_table : Create a pivot table as a DataFrame.

    Notes
    -----
    Any Series passed will have their name attributes used unless row or column
    names for the cross-tabulation are specified.

    Any input passed containing Categorical data will have **all** of its
    categories included in the cross-tabulation, even if the actual data does
    not contain any instances of a particular category.

    In the event that there aren't overlapping indexes an empty DataFrame will
    be returned.

    Reference :ref:`the user guide <reshaping.crosstabulations>` for more examples.

    Examples
    --------
    >>> a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
    ...               "bar", "bar", "foo", "foo", "foo"], dtype=object)
    >>> b = np.array(["one", "one", "one", "two", "one", "one",
    ...               "one", "two", "two", "two", "one"], dtype=object)
    >>> c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
    ...               "shiny", "dull", "shiny", "shiny", "shiny"],
    ...              dtype=object)
    >>> pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])
    b   one        two
    c   dull shiny dull shiny
    a
    bar    1     2    1     0
    foo    2     2    1     2

    Here 'c' and 'f' are not represented in the data and will not be
    shown in the output because dropna is True by default. Set
    dropna=False to preserve categories with no data.

    >>> foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])
    >>> bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])
    >>> pd.crosstab(foo, bar)
    col_0  d  e
    row_0
    a      1  0
    b      0  1
    >>> pd.crosstab(foo, bar, dropna=False)
    col_0  d  e  f
    row_0
    a      1  0  0
    b      0  1  0
    c      0  0  0

## 1.10.	Find the number of passengers per class. <a name="ch1_10"></a>

In [12]:
print(df.Pass_class.value_counts())

3    709
1    323
2    277
Name: Pass_class, dtype: int64

## 1.11.	For each combination of Gender and Pass_class obtain the number of survivals. <a name="ch1_11"></a>

In [13]:
df.groupby(['sex','Pass_class','survived']).size()

sex     Pass_class  survived
female  1           0             5
                    1           139
        2           0            12
                    1            94
        3           0           110
                    1           106
male    1           0           118
                    1            61
        2           0           146
                    1            25
        3           0           418
                    1            75
dtype: int64

## 1.12.	What is the average age per gender? <a name="ch1_12"></a>

In [14]:
df.groupby(['sex']).age.mean()

sex
female    28.687071
male      30.585233
Name: age, dtype: float64

## 1.13.	For each combination of Gender and Pass_class obtain the maximum and minimum age. <a name="ch1_13"></a>

In [17]:
help(pd.DataFrame.groupby)

Help on function groupby in module pandas.core.frame:

groupby(self, by=None, axis: 'Axis' = 0, level: 'Level | None' = None, as_index: 'bool' = True, sort: 'bool' = True, group_keys: 'bool' = True, squeeze: 'bool | lib.NoDefault' = <no_default>, observed: 'bool' = False, dropna: 'bool' = True) -> 'DataFrameGroupBy'
    Group DataFrame using a mapper or by a Series of columns.

    A groupby operation involves some combination of splitting the
    object, applying a function, and combining the results. This can be
    used to group large amounts of data and compute operations on these
    groups.

    Parameters
    ----------
    by : mapping, function, label, or list of labels
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If a list or ndarray of length
        equal to the selected axis is passed (see the `groupby user guide
        <https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#splitting-an-object-into-groups>`_),
        the values are used as-is to determine the groups. A label or list
        of labels may be passed to group by the columns in ``self``.
        Notice that a tuple is interpreted as a (single) key.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Split along rows (0) or columns (1).
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels.
    as_index : bool, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output.
    sort : bool, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group. Groupby preserves the order of rows within each group.
    group_keys : bool, default True
        When calling apply, add group keys to index to identify pieces.
    squeeze : bool, default False
        Reduce the dimensionality of the return type if possible,
        otherwise return a consistent type.

        .. deprecated:: 1.1.0

    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.
    dropna : bool, default True
        If True, and if group keys contain NA values, NA values together
        with row/column will be dropped.
        If False, NA values will also be treated as the key in groups.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrameGroupBy
        Returns a groupby object that contains information about the groups.

    See Also
    --------
    resample : Convenience method for frequency conversion and resampling
        of time series.

    Notes
    -----
    See the `user guide
    <https://pandas.pydata.org/pandas-docs/stable/groupby.html>`__ for more
    detailed usage and examples, including splitting an object into groups,
    iterating through groups, selecting a group, aggregation, and more.

    Examples
    --------
    >>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
    ...                               'Parrot', 'Parrot'],
    ...                    'Max Speed': [380., 370., 24., 26.]})
    >>> df
       Animal  Max Speed
    0  Falcon      380.0
    1  Falcon      370.0
    2  Parrot       24.0
    3  Parrot       26.0
    >>> df.groupby(['Animal']).mean()
            Max Speed
    Animal
    Falcon      375.0
    Parrot       25.0

    **Hierarchical Indexes**

    We can groupby different levels of a hierarchical index
    using the `level` parameter:

    >>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
    ...           ['Captive', 'Wild', 'Captive', 'Wild']]
    >>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
    >>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
    ...                   index=index)
    >>> df
                    Max Speed
    Animal Type
    Falcon Captive      390.0
           Wild         350.0
    Parrot Captive       30.0
           Wild          20.0
    >>> df.groupby(level=0).mean()
            Max Speed
    Animal
    Falcon      370.0
    Parrot       25.0
    >>> df.groupby(level="Type").mean()
             Max Speed
    Type
    Captive      210.0
    Wild         185.0

    We can also choose to include NA in group keys or not by setting
    `dropna` parameter, the default setting is `True`.

    >>> l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by=["b"]).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5

    >>> df.groupby(by=["b"], dropna=False).sum()
        a   c
    b
    1.0 2   3
    2.0 2   5
    NaN 1   4

    >>> l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
    >>> df = pd.DataFrame(l, columns=["a", "b", "c"])

    >>> df.groupby(by="a").sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0

    >>> df.groupby(by="a", dropna=False).sum()
        b     c
    a
    a   13.0   13.0
    b   12.3  123.0
    NaN 12.3   33.0

## 1.14.	Get the percentage of minors. <a name="ch1_14"></a>

In [20]:
# Number of passengers under 18
Numb_minors = (df.age < 18).sum()

Perc_minors = Numb_minors / total_pass
print('Precentage of minors = ', Perc_minors)

NameError: name 'total_pass' is not defined

## 1.15.	What is the total of minors who survive? <a name="ch1_15"></a>

In [21]:
print('The total of number of minor who survive is = ', (df[df.age < 18]["survived"] == 1).sum())

The total of number of minor who survive is =  81

## 1.16.	What is the average age of the minors? What is the average age of the minors which survive? <a name="ch1_16"></a>

In [22]:
print('The average age of minors is = ', df.loc[(df.age <18)].age.mean())

print('The average age of minors which survice is = ',???)

# dataframe with  minor passengers
df.loc[df.age < 18]

SyntaxError: invalid syntax (3633788984.py, line 3)

## 1.17.	According to the survival status obtain the median, average, and skew age of minors. Compare with the average age of minors. <a name="ch1_17"></a>

In [23]:
print('The median, average, and skew age of minors, according to survival status is ')
(df.loc[df.age < 18]).groupby('survived').agg({'age':['median', 'mean', 'skew']})

The median, average, and skew age of minors, according to survival status is =

            age
         median       mean      skew
survived
0          11.0  10.309360 -0.328843
1           7.0   8.013375  0.227753

## Compare with the average age of minors. What to concluded regarding the shape of the distribution of the age of minors according to survival status?¶

## 1.18.	Get the covariance matrix for all the numerical attributes.  <a name="ch1_18"></a>

In [24]:
# get the dataframe only with numerical attributes
df_num =???

# see the dataframe only with numerical attributes
df_num.head()
# covariance matrix of numerical attributes
help(pd.DataFrame.cov)

SyntaxError: invalid syntax (1429549042.py, line 2)

## 1.19.	Find the most correlated pair of attributes. Comment on the results.  <a name="ch1_19"></a>

In [25]:
# correlation matrix of numerical attributes
help(pd.DataFrame.cov)
df_num.???

SyntaxError: invalid syntax (4246667601.py, line 3)

### Comment? Insights?

**Q: Does it make sense to correlate `Pass_class` and `sex` along with the numeric features? How?**